# shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-be9549de-8b69-4deb-b87c-114e30467b98]
module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=0102c09a-f6c1-42f8-8165-b384193d5ce6]
module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=staging_kafka-cluster-id]
module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=staging_cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default will be created
  + resource "aws_cognito_user_pool" "default" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "ON"
      + name                       = "staging"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all                   = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type = "String"
          + name                = "email"
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "name"
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "sub"
        }

      + software_token_mfa_configuration {
          + enabled = true
        }
    }

  # module.common_resources.module.cognito_user_pool.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "staging_user-pool-id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*